; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain zenotravel)
;(:requirements :typing :fluents)
(:types locatable city - object
	aircraft person - locatable)
(:predicates (located ?x - locatable  ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (located ?p ?c)
                 (located ?a ?c))
 :effect (and (not (located ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (located ?a ?c))
 :effect (and (not (in ?p ?a))
              (located ?p ?c)
		(decrease (onboard ?a) 1)))

(:action flyslow
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (located ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (located ?a ?c1))
              (located ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action flyfast
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (located ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (located ?a ?c1))
              (located ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft)
 :precondition (and (> (capacity ?a) (fuel ?a))

		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
; Describe the problem Zeno13 from the ZenoTravel domain
(define (problem ZENO13)
(:domain zenotravel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	boston - city
	newyork - city
	washington - city
	portland - city
	philadelphie - city
	atlanta - city
	)
(:init
	(located plane1 philadelphie)
	(= (capacity plane1) 2326)
	(= (fuel plane1) 205)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(located plane2 washington)
	(= (capacity plane2) 12132)
	(= (fuel plane2) 1469)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 9)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 9)
	(located plane3 portland)
	(= (capacity plane3) 5204)
	(= (fuel plane3) 1532)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 7)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 8)
	(located person1 newyork)
	(located person2 washington)
	(located person3 newyork)
	(located person4 philadelphie)
	(located person5 atlanta)
	(located person6 newyork)
	(located person7 boston)
	(located person8 washington)
	(located person9 newyork)
	(located person10 atlanta)
	(= (distance boston boston) 0)
	(= (distance boston newyork) 619)
	(= (distance boston washington) 565)
	(= (distance boston portland) 886)
	(= (distance boston philadelphie) 596)
	(= (distance boston atlanta) 766)
	(= (distance newyork boston) 619)
	(= (distance newyork newyork) 0)
	(= (distance newyork washington) 561)
	(= (distance newyork portland) 756)
	(= (distance newyork philadelphie) 760)
	(= (distance newyork atlanta) 980)
	(= (distance washington boston) 565)
	(= (distance washington newyork) 561)
	(= (distance washington washington) 0)
	(= (distance washington portland) 657)
	(= (distance washington philadelphie) 702)
	(= (distance washington atlanta) 639)
	(= (distance portland boston) 886)
	(= (distance portland newyork) 756)
	(= (distance portland washington) 657)
	(= (distance portland portland) 0)
	(= (distance portland philadelphie) 546)
	(= (distance portland atlanta) 510)
	(= (distance philadelphie boston) 596)
	(= (distance philadelphie newyork) 760)
	(= (distance philadelphie washington) 702)
	(= (distance philadelphie portland) 546)
	(= (distance philadelphie philadelphie) 0)
	(= (distance philadelphie atlanta) 850)
	(= (distance atlanta boston) 766)
	(= (distance atlanta newyork) 980)
	(= (distance atlanta washington) 639)
	(= (distance atlanta portland) 510)
	(= (distance atlanta philadelphie) 850)
	(= (distance atlanta atlanta) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(located plane1 philadelphie)
	(located person1 philadelphie)
	(located person2 atlanta)
	(located person3 philadelphie)
	(located person4 boston)
	(located person5 washington)
	(located person6 portland)
	(located person8 boston)
	(located person9 portland)
	(located person10 philadelphie)
	))

(:metric minimize (total-fuel-used))


)

; plan
1. (flyslow plane3 portland washington)
   deleted: (located plane3 portland)
   added: (located plane3 washington)
   changed: (total-fuel-used) from 0 to 1314, (fuel plane3) from 1532 to 218
   goals met: 1 of 10
2. (board person2 plane2 washington)
   deleted: (located person2 washington)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 10
3. (board person8 plane3 washington)
   deleted: (located person8 washington)
   added: (in person8 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 1 of 10
4. (board person4 plane1 philadelphie)
   deleted: (located person4 philadelphie)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 10
5. (refuel plane3)
   changed: (fuel plane3) from 218 to 5204
   goals met: 1 of 10
6. (flyfast plane3 washington boston)
   deleted: (located plane3 washington)
   added: (located plane3 boston)
   changed: (total-fuel-used) from 1314 to 5269, (fuel plane3) from 5204 to 1249
   goals met: 1 of 10
7. (refuel plane2)
   changed: (fuel plane2) from 1469 to 12132
   goals met: 1 of 10
8. (flyfast plane2 washington atlanta)
   deleted: (located plane2 washington)
   added: (located plane2 atlanta)
   changed: (total-fuel-used) from 5269 to 11020, (fuel plane2) from 12132 to 6381
   goals met: 1 of 10
9. (debark person8 plane3 boston)
   deleted: (in person8 plane3)
   added: (located person8 boston)
   changed: (onboard plane3) from 1 to 0
   goals met: 2 of 10
10. (flyslow plane3 boston washington)
   deleted: (located plane3 boston)
   added: (located plane3 washington)
   changed: (total-fuel-used) from 11020 to 12150, (fuel plane3) from 1249 to 119
   goals met: 2 of 10
11. (board person5 plane2 atlanta)
   deleted: (located person5 atlanta)
   added: (in person5 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 2 of 10
12. (board person10 plane2 atlanta)
   deleted: (located person10 atlanta)
   added: (in person10 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 2 of 10
13. (flyslow plane2 atlanta philadelphie)
   deleted: (located plane2 atlanta)
   added: (located plane2 philadelphie)
   changed: (total-fuel-used) from 12150 to 15550, (fuel plane2) from 6381 to 2981
   goals met: 2 of 10
14. (debark person10 plane2 philadelphie)
   deleted: (in person10 plane2)
   added: (located person10 philadelphie)
   changed: (onboard plane2) from 3 to 2
   goals met: 3 of 10
15. (flyslow plane2 philadelphie washington)
   deleted: (located plane2 philadelphie)
   added: (located plane2 washington)
   changed: (total-fuel-used) from 15550 to 18358, (fuel plane2) from 2981 to 173
   goals met: 3 of 10
16. (refuel plane1)
   changed: (fuel plane1) from 205 to 2326
   goals met: 3 of 10
17. (flyslow plane1 philadelphie newyork)
   deleted: (located plane1 philadelphie)
   added: (located plane1 newyork)
   changed: (total-fuel-used) from 18358 to 19118, (fuel plane1) from 2326 to 1566
   goals met: 2 of 10
18. (refuel plane2)
   changed: (fuel plane2) from 173 to 12132
   goals met: 2 of 10
19. (board person6 plane1 newyork)
   deleted: (located person6 newyork)
   added: (in person6 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 10
20. (flyslow plane1 newyork philadelphie)
   deleted: (located plane1 newyork)
   added: (located plane1 philadelphie)
   changed: (total-fuel-used) from 19118 to 19878, (fuel plane1) from 1566 to 806
   goals met: 3 of 10
21. (debark person5 plane2 washington)
   deleted: (in person5 plane2)
   added: (located person5 washington)
   changed: (onboard plane2) from 2 to 1
   goals met: 4 of 10
22. (flyslow plane2 washington atlanta)
   deleted: (located plane2 washington)
   added: (located plane2 atlanta)
   changed: (total-fuel-used) from 19878 to 22434, (fuel plane2) from 12132 to 9576
   goals met: 4 of 10
23. (debark person4 plane1 philadelphie)
   deleted: (in person4 plane1)
   added: (located person4 philadelphie)
   changed: (onboard plane1) from 2 to 1
   goals met: 4 of 10
24. (board person5 plane3 washington)
   deleted: (located person5 washington)
   added: (in person5 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 3 of 10
25. (refuel plane3)
   changed: (fuel plane3) from 119 to 5204
   goals met: 3 of 10
26. (debark person2 plane2 atlanta)
   deleted: (in person2 plane2)
   added: (located person2 atlanta)
   changed: (onboard plane2) from 1 to 0
   goals met: 4 of 10
27. (debark person5 plane3 washington)
   deleted: (in person5 plane3)
   added: (located person5 washington)
   changed: (onboard plane3) from 1 to 0
   goals met: 5 of 10
28. (flyslow plane2 atlanta newyork)
   deleted: (located plane2 atlanta)
   added: (located plane2 newyork)
   changed: (total-fuel-used) from 22434 to 26354, (fuel plane2) from 9576 to 5656
   goals met: 5 of 10
29. (board person9 plane2 newyork)
   deleted: (located person9 newyork)
   added: (in person9 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 5 of 10
30. (flyslow plane2 newyork portland)
   deleted: (located plane2 newyork)
   added: (located plane2 portland)
   changed: (total-fuel-used) from 26354 to 29378, (fuel plane2) from 5656 to 2632
   goals met: 5 of 10
31. (flyfast plane3 washington newyork)
   deleted: (located plane3 washington)
   added: (located plane3 newyork)
   changed: (total-fuel-used) from 29378 to 33305, (fuel plane3) from 5204 to 1277
   goals met: 5 of 10
32. (board person1 plane3 newyork)
   deleted: (located person1 newyork)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 5 of 10
33. (flyslow plane3 newyork boston)
   deleted: (located plane3 newyork)
   added: (located plane3 boston)
   changed: (total-fuel-used) from 33305 to 34543, (fuel plane3) from 1277 to 39
   goals met: 5 of 10
34. (refuel plane3)
   changed: (fuel plane3) from 39 to 5204
   goals met: 5 of 10
35. (flyslow plane3 boston philadelphie)
   deleted: (located plane3 boston)
   added: (located plane3 philadelphie)
   changed: (total-fuel-used) from 34543 to 35735, (fuel plane3) from 5204 to 4012
   goals met: 5 of 10
36. (board person4 plane1 philadelphie)
   deleted: (located person4 philadelphie)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 5 of 10
37. (debark person6 plane1 philadelphie)
   deleted: (in person6 plane1)
   added: (located person6 philadelphie)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 10
38. (board person6 plane3 philadelphie)
   deleted: (located person6 philadelphie)
   added: (in person6 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 5 of 10
39. (debark person1 plane3 philadelphie)
   deleted: (in person1 plane3)
   added: (located person1 philadelphie)
   changed: (onboard plane3) from 2 to 1
   goals met: 6 of 10
40. (flyslow plane3 philadelphie portland)
   deleted: (located plane3 philadelphie)
   added: (located plane3 portland)
   changed: (total-fuel-used) from 35735 to 36827, (fuel plane3) from 4012 to 2920
   goals met: 6 of 10
41. (debark person6 plane3 portland)
   deleted: (in person6 plane3)
   added: (located person6 portland)
   changed: (onboard plane3) from 1 to 0
   goals met: 7 of 10
42. (flyslow plane3 portland newyork)
   deleted: (located plane3 portland)
   added: (located plane3 newyork)
   changed: (total-fuel-used) from 36827 to 38339, (fuel plane3) from 2920 to 1408
   goals met: 7 of 10
43. (board person3 plane3 newyork)
   deleted: (located person3 newyork)
   added: (in person3 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 7 of 10
44. (flyslow plane3 newyork boston)
   deleted: (located plane3 newyork)
   added: (located plane3 boston)
   changed: (total-fuel-used) from 38339 to 39577, (fuel plane3) from 1408 to 170
   goals met: 7 of 10
45. (refuel plane3)
   changed: (fuel plane3) from 170 to 5204
   goals met: 7 of 10
46. (flyfast plane3 boston philadelphie)
   deleted: (located plane3 boston)
   added: (located plane3 philadelphie)
   changed: (total-fuel-used) from 39577 to 43749, (fuel plane3) from 5204 to 1032
   goals met: 7 of 10
47. (refuel plane2)
   changed: (fuel plane2) from 2632 to 12132
   goals met: 7 of 10
48. (refuel plane1)
   changed: (fuel plane1) from 806 to 2326
   goals met: 7 of 10
49. (flyfast plane1 philadelphie boston)
   deleted: (located plane1 philadelphie)
   added: (located plane1 boston)
   changed: (total-fuel-used) from 43749 to 44941, (fuel plane1) from 2326 to 1134
   goals met: 6 of 10
50. (debark person4 plane1 boston)
   deleted: (in person4 plane1)
   added: (located person4 boston)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 10
51. (flyslow plane1 boston philadelphie)
   deleted: (located plane1 boston)
   added: (located plane1 philadelphie)
   changed: (total-fuel-used) from 44941 to 45537, (fuel plane1) from 1134 to 538
   goals met: 8 of 10
52. (debark person3 plane3 philadelphie)
   deleted: (in person3 plane3)
   added: (located person3 philadelphie)
   changed: (onboard plane3) from 1 to 0
   goals met: 9 of 10
53. (debark person9 plane2 portland)
   deleted: (in person9 plane2)
   added: (located person9 portland)
   changed: (onboard plane2) from 1 to 0
   goals met: 10 of 10
